[
  {
    "username": "marypickard01",
    "review": "Came out exactly as ordered These were a wedding gift and friends really enjoyed them",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Sara",
    "review": "These coasters are such good quality! Very thick and sturdy Super cute detailing DeskCandy did a great job with my design Came out perfect!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Alyssa",
    "review": "Beautiful item and great quality Perfect for a wedding gift!",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "Christina",
    "review": "Perfection! Such a nice piece!",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "Alissa",
    "review": "This is a great quality product The shop was able to modify my order after I mistakenly approved it incorrectly - kudos to them for going the extra mile for their customers! Thank you! Very excited to gift this",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Carrie",
    "review": "This item was beautiful and exactly what I expected! Bought to use for all my wedding itinerary and I’m in love with it! Customer service was quick and friendly Highly recommend 💜",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Taylor",
    "review": "The seller reached out and had amazing communication! Love the product! Will order again!",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Richie",
    "review": "Great looking good quality !",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Kirsten",
    "review": "Great piece I love it",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "cait",
    "review": "Beautiful!!! It was shipped in time as well :)",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "Robin",
    "review": "It was a fabulous engagement gift and the quality is also incredible as well as the efficiency abs ease of dealing with this company ❤️",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "Jane",
    "review": "My letters are looking more stylish already! Great service and the stamp is well made",
    "product": "Classic Address Stamp"
  },
  {
    "username": "normandniki",
    "review": "Well done product I would order again from them",
    "product": "Slate Coaster Set"
  },
  {
    "username": "Joanie",
    "review": "Beautiful, prompt Would definitely order again",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Katie",
    "review": "Beautiful stamp! It is super high quality and stamps perfectly with no smearing or extra ink on the sides like some other stamps Great communication from seller",
    "product": "Classic Address Stamp"
  },
  {
    "username": "molly",
    "review": "Looks exactly like the picture Cant wait to use it!",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "Nikki",
    "review": "Great customer service! Shipping was fast and the stamp is so cute! ♥️",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Laura",
    "review": "Beautiful personalized wedding gift! The vendor, Natasha, was very attentive to my order making sure I was happy with the marble & wood cheese board Beautiful craftsmanship! Highly recommended!",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "Samantha",
    "review": "So dang cute! I love these!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Chelsi Singletary",
    "review": "Loved it! Turned out awesome and was the perfect gift",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Binnie",
    "review": "Beautiful coasters! I bought this for my sister’s engagement gift and she loved the personalization of these The coasters have a good weight to it and are crafted with high quality materials I’d definitely order again as these make the perfect gifts!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Leah",
    "review": "These address stamps are perfect This is the second time I’ve ordered from this shop as we recently moved and I was so pleased from the first go round that I couldn’t imagine using anyone else I love this stamp so much!",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Riley Pfyffef",
    "review": "SO CUTE! They were done exactly how I wanted and customer service was awesome",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Helen",
    "review": "This turned out so nice! Stamps very well also!",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Shannan",
    "review": "Absolutely perfect Fast shipping and a beautiful product! Thank you so much!",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Vanessa",
    "review": "Ordered this to go with matching coasters I ordered as a gift last year The product is beautiful and well made",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "Nicole",
    "review": "I got these as a wedding gift for a friend They absolutely loved them!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Alissa",
    "review": "This is a great quality product The shop was able to modify my order after I mistakenly approved it incorrectly - kudos to them for going the extra mile for their customers! Thank you! Very excited to gift this",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Carrie",
    "review": "Exactly as pictured Very heavy and really good quality Very happy with my purchase",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "M",
    "review": "Incredibly pleased with end product Beautifully engraved and crafted Excellent quality Thanks Natasha!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Kalah",
    "review": "Beautiful quality! My sister loved her gift!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Emily",
    "review": "So great that I ordered these again for another couple!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Samantha",
    "review": "These turned out so great!!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Arielle",
    "review": "I bought these as a house warming gift for someone Loved the quality & the design, will definitely order a set for myself as well!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Madeline",
    "review": "These are even more beautiful in person!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Erin",
    "review": "Beautiful, they are great quality",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Kelly",
    "review": "Beautiful!!! I love these Second product i bought from here One is a gift for my son & wife The other, anniversary gift for husband (& me)",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Britta",
    "review": "I’m obsessed with how these turned out! Such a great housewarming gift!!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Krista",
    "review": "Quick to provide proof, follow up, and ship! This was the perfect house warming gift for a friend",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Stacie",
    "review": "Shipping was fast! Item turned out just as expected and perfect!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Hannah",
    "review": "I've ordered a bunch of coasters from this shop and every set has been beautiful I would recommend this shop to anyone looking for a personalized, high quality gift",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Kimberly",
    "review": "Beautiful and quality product! Love it!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Hannah",
    "review": "I used this stamp for all of my save the dates, and it stamped the envelope perfectly every time The shipping was fast I can’t wait to use this on all of our invitations as well, as it makes the process so easy",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Michelle",
    "review": "I was very short on time & the seller really went out of her way to make it all happen LOVE THE COASTERS!!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Emily",
    "review": "This is a go-to wedding present for me People love them and I can count of the quality to be perfect every time! I asked the seller to mock up two of the design options to help me decide, and she did so lightning quick without batting an eye I'll be back again!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Abbie",
    "review": "Gave this as a wedding gift and they loved it!! A beautiful, handmade way to personalize a special occasion and memory",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "Taylor Brandenburg",
    "review": "Got these for my parents as an anniversary gift! They love them- great quality, very thick and beautiful craftsmanship! I will definitely order these again as gifts for friends and family",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Kristen",
    "review": "Love our new coasters!! Super great quality and got fast responses when I wanted to see multiple proofs before approving the final design Super friendly customer service and overall a beautiful purchase Shipping was also extremely fast! Thanks!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Leigh",
    "review": "Super cute item & prompt advice from the seller Thanks so much for making me mail jazzier",
    "product": "Classic Address Stamp"
  },
  {
    "username": "RUTH",
    "review": "Great quality!!! Excellent for a gift",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "Christine",
    "review": "Completely awesome product! I purchased these as a house warming gift and then came back and bought a set for myself The personalization is a nice touch These are solid coasters - not flimsy",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Luanda",
    "review": "Beautiful work! Shop owner is easy to work with and quick, I got my order sooner than expected! This was a gift for friends who recently married and they absolutely adored it Don't hesitate to order for yourself or as a gift!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Amber",
    "review": "Bought as a gift Great quality! Shipped super quick I will definitely order again!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Michelle",
    "review": "Made for the perfect wedding gift Fast shipping, good customers service & great quality!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Jordan",
    "review": "Fantastic product! Would buy again",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "delaniegg",
    "review": "My friend loved these! Would definitely buy again",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "allermom",
    "review": "Really lovely address stamp! So easy to order and great price point! Thank you so much!",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Hannah",
    "review": "This will be a great bridal shower gift for one of my closest girlfriends! ✨",
    "product": "Italian Marble Wood Cheese Board"
  },
  {
    "username": "Nadine",
    "review": "Gift recipients loved it and thought it looked really elegant! Thank you",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Bailey",
    "review": "Absolutely gorgeous!!! I love it and it made a perfect wedding gift!!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Christine",
    "review": "Absolutely solid coasters!! I purchased them as a house warming gift and love them so much that I’m buying a set for myself Great qualify and thick",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Denaya",
    "review": "These were exactly what I was hoping for! I plan to make another purchase in the very near future Thank you!!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Barbara Lynn",
    "review": "I just love these! Clean up easily too I will be ordering more for gifts",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Mark",
    "review": "These look amazing in person They are very elegant and also unique with the combination of both marble and wood",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "hayley",
    "review": "Our stamp turned out great! The shipping was pretty quick and it looks exactly like we wanted! Can’t wait to use it!",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Danielle",
    "review": "Awesome job! Looks just like the template",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Miranda",
    "review": "My expectations were 100% exceeded! These Coasters are beautiful and made very well Thank you so much Christmas is coming up and I will be coming back to this business",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Jessica",
    "review": "I cannot say enough how amazing these turned out!! They are so beautiful! The seller made sure to get them to me in my short time frame and once again they are absolutely gorgeous!!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Monica",
    "review": "My friends absolutely loved them !!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Beverly",
    "review": "These came out way nicer than I even thought Thank you so much for your help with everything! Love these!!!!!!!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "LaDonna",
    "review": "Absolutely beautiful! Great quality and craftmanship!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Sarah M Bones",
    "review": "This was a gift and absolutely worth the joy on their faces! I never personally held the coasters/cheese platter, but saw them unwrapping it over FaceTime Each was packed in both bubble wrapping and hard packaging They said quality was exquisite, very heavy And my personal customization was spelled correctly (foreign languages) and in correct font Overall, very satisfied with this purchase! Will purchase again!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Emily",
    "review": "These are beautiful! Shipped quickly Heavy and clearly well made Perfect for a housewarming gift!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Elizabeth",
    "review": "I love this stamper! It's great, high-quality, and super cute Also, my 12-year old loved helping with wedding thank-you cards because he got to use the stamper on the envelope! :)",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Ashlee",
    "review": "So so so beautiful!!! Really sturdy/heavy coaster, sends the design to you before making, and they came out fabulously! I know my friends will love them!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Katelin",
    "review": "I bought these coasters as a wedding gift and they turned out so beautiful!! Great quality and the engraving is perfect!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Savannah",
    "review": "So beautiful! Got these for a wedding gift",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Lisa",
    "review": "Love these custom coasters Beautiful, personalized wedding gift",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Alondra",
    "review": "I absolutely loved them! They are beautiful and great quality! Also, they came just in time! 💛 Definitely recommend as a gift or even for your self!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Lauren",
    "review": "These coasters turned out great and were a beautiful gift! The only thing I will say is that the shipping times listed on Etsy are not accurate at this time due to Covid, so that they arrived about 10 days after I was expecting them to",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Rachel",
    "review": "Ordered these for a friends wedding and they came out even more beautiful then I imagined They’re so well made, crisp and eye catching Wow I’m so pleased! Incredible work!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "stoloral",
    "review": "Turned out great and shipped fast",
    "product": "Classic Address Stamp"
  },
  {
    "username": "1261999rose",
    "review": "My coasters were beautiful, and the company was very easy to work with! She reviewed how the design would look with me before starting production Highly recommend!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Leah",
    "review": "So beautiful! Thank you so much",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "alannavagianos",
    "review": "So beautiful! They were so well-made, had a great clean look about them My friend loved them!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "sheri",
    "review": "Love it!! this is so adorable and shipped fast!",
    "product": "Holiday Cottage Ornament"
  },
  {
    "username": "kcase6787",
    "review": "love love love, very well made and beautiful Perfect house warming present",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Brooke",
    "review": "So cute!! It arrived quickly and my dog June loves the dog treats! Thank you!",
    "product": "Dog Treat Jar"
  },
  {
    "username": "Brooke",
    "review": "My husband loved this anniversary gift Thank you",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Francisco",
    "review": "Our family loves that it is personalized  The Process was easy I definitely recommend this company",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "lroche619gmailcomi",
    "review": "I ordered two of these cheese boards and both of them are beautiful!",
    "product": "Slate Cheese Board"
  },
  {
    "username": "Chloe",
    "review": "Absolutely love these So happy I purchased them They're gorgeous!!!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "L",
    "review": "This was the perfect gift for my partner! Gorgeous quality, perfect design!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Deepika",
    "review": "Looks great! They're thicker than I expected, but the quality is fantastic!",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Kassi",
    "review": "So happy with how my stamp turned out! Saved me so much time! Beautiful designs Shipped fast",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Kathryn",
    "review": "Just as described, shipped quickly, great quality!",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Natasha",
    "review": "Just as pictured, great quality!",
    "product": "Classic Address Stamp"
  },
  {
    "username": "Tori",
    "review": "These coasters are beautiful! My parents will love them Great craftsmanship, communication, and delivery I've marked this shop for future needs and already recommended to others",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "sind07",
    "review": "Recipient loved this wedding gift! The coasters look beautiful With the current pandemic, seller informed me of the process delay ahead of time",
    "product": "Italian Marble Wood Coaster Set"
  },
  {
    "username": "Kate Seidl",
    "review": "Amazing quality and ships fast Thank you!",
    "product": "Italian Marble Wood Coaster Set"
  }
]